Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G74A.tmx
Source language: en_us
Languages: zh_cn

source: Delma Hughes: I grew up in a world without parents
zh_cn: 德尔玛休斯：我在没有父母的世界里长大成人

source: Delma Hughes spent most of her childhood in care.
zh_cn: 德尔玛休斯的童年时代大部分都是在救助中度过的。

source: She didn't realise she had a mother and father - she didn't even know her date of birth - but her big sister meant the world to her
zh_cn: 她没有父母的意识，姐姐就是她的整个世界。她甚至不知道自己的生日。

source: I was 15 before I discovered that I actually had parents.
zh_cn: 我发现自己事实上是有父母的时候已经15岁了。

source: Until that point I'd lived in a world where parents didn't exist - the care system.
zh_cn: 在那之前，我一直依靠救助体制生活，那是一个没有父母的世界。

source: No one in care dwells on family; my sister Lucy and I didn't have one, and that was that.
zh_cn: 接受救助的人都没有亲人可以倚靠，姐姐露西和我也没有；也就那么回事。

source: I didn't even know when my birthday was.
zh_cn: 我甚至不知道自己的生日是哪天。

source: I now know it's 25 September, but I didn't know it as a child.
zh_cn: 虽然现在我知道是9月25，但孩提时代我不知道。

source: I never celebrated it.
zh_cn: 我从来没有过过生日。

source: There wasn't a morning when I was woken up with presents or someone made me a cake.
zh_cn: 没有一个早晨是我醒来就看见了礼物或是有人给我做了蛋糕。

source: I've never really known why my mum couldn't look after me.
zh_cn: 我从来没有真正了解过我的母亲为什么无法照顾我。

source: It wasn't drink, drugs, madness or any specific condition with a label. Perhaps she just couldn't function properly.
zh_cn: 不是因为酗酒、吸毒、精神失常或是别的什么特殊情况，可能就是她无法适当地履行她做母亲的职责。

source: She had seven children in all and I am number three.
zh_cn: 我的母亲一共有7个孩子，我排行第三。

source: I only met my eldest sister a couple of times as an adult and she seemed a fantastic person. I was in awe of her, but she died and so I never got to know her.
zh_cn: 成年后我见过我的大姐，只有几次。她看上去有些怪，我有些怕她。后来她死了，我便再没机会了解她。

source: She was taken in by our grandmother and grew up with her.
zh_cn: 大姐是由外祖母带走并抚育成人的。

source: I assume one was enough for my granny and so Lucy and I got scooped up by social services in 1961.
zh_cn: 我猜对外祖母来说一个已经够她受的了，所以1961年时社会福利机构便“接管”了露西和我。

source: The file says that we'd been left alone for days with no food in the house.
zh_cn: 档案中显示，我俩当时被单独留在房子里已经好几天了，没有食物。

source: I was 18 months and Lucy was three and a half.
zh_cn: 那时我18个月，而露西3岁半。

source: Mum went on to have another four children, all of whom, bar the last, were taken into care, but I didn't know about them or my eldest sister until much later.
zh_cn: 母亲后来又有了4个孩子。除了最小的那一个，其他的都被“纳入”了救助范围。直到很久以后我才知道她们，包括我的大姐。

source: To me, Lucy and I were alone in the world.
zh_cn: 在我看来，在这个世界上露西和我是没有依靠的。

source: She was everything to me.
zh_cn: 她是我的一切。

source: Of course, we had a father but he never looked after us.
zh_cn: 当然，我们有父亲，但他从来没有照顾过我们。

source: I did go to his funeral - in 1978 the police knocked on my door and told me they had sad news. My dad had died.
zh_cn: 我曾经去过他的墓地——1978年警察敲响了我的门，告诉我说他们带来了令人悲伤的消息，我的父亲过世了。

source: The trouble is, I didn't know how to react and actually felt bad for the officers who'd come around to break this monumental news.
zh_cn: 问题是，我不知道要怎样反应，我都觉得对不住那些给我带来消息的警察们。

source: Because of being shunted around in care for so long, my childhood is confusing. It's like a jigsaw with most of the pieces missing.
zh_cn: 因为长时间地辗转于各个救助机构中，我的童年混乱不堪，就像是一副拼图，其中大部分小片不见了。

source: At night for years I'd sit staring at pieces trying to solve the puzzle. Lucy has no memory either.
zh_cn: 很多年里，我总是在晚上盯着这些碎片试图将谜团解开，然而连露西也没有印象。

source: Eventually I worked it out through my social services file when I was 30, although I had to threaten to sue North Wales social services to get it.
zh_cn: 在30岁的时候，我终于在我的救助档案中找到了答案。虽然为了得到它，我不得不威胁北威尔士社会慈善机构说要起诉它们。

source: In all, I lived in about 20 places and if you don't have a conventional childhood, it's all a bit blank.
zh_cn: 我呆过的地方一共有20个左右。当你的童年和普通孩子不一样时，你的童年会有一些空白。

source: You don't have photo albums, family holidays and funny stories that link up the years.
zh_cn: 什么影集、家庭聚会和那些与岁月有关的有趣的故事，你都没有。

source: On top of the haziness created by a fractured childhood, there is confusion created by the fact that we were drugged most of the time.
zh_cn: 除了因记忆断裂带来的模糊感，还有一种混乱感，因为大部分时间里我们都被麻醉了。

source: When I showed my GP my file he couldn't believe the stuff I'd been prescribed as a child.
zh_cn: 当我把档案给我的医生看时，对我孩子时代医生给开的处方，他简直无法相信。

source: I was always dosed up with tranquillisers and sleeping pills.
zh_cn: 因为我常常服用镇静剂和安眠药。

source: If I think really hard, I have vague memories from the nursery we were first taken to when the state became my corporate parent.
zh_cn: 只有在真正用力去想时，我才能模模糊糊回忆起我和露西第一次被带到育婴院，也就是州政府成为我们法律上的监护人之后的事情。

source: But mostly I remember how I felt.
zh_cn: 但是对自己的感受，我却大部分都记得。

source: The overwhelming sense of not being loved.
zh_cn: 那是一种不被爱的刻骨铭心的感觉。

source: I wasn't special to anyone.
zh_cn: 没人把我放在心上。

source: Lucy was special to me but I think as a younger, insecure sibling I was probably too much for her to cope with.
zh_cn: 于我，露西是特别的；但是我想，对于露西，我这个年幼的不能给人安全感的妹妹可能是个太大的负担。

source: I was shocked when I went to school and saw normal kids with mums waiting with snacks and cuddles at the school gate.
zh_cn: 上学后，当我看到正常的孩子都有妈妈带着便当等候，和妈妈在校门口互相拥抱时，我惊呆了。

source: I didn't know that happened.
zh_cn: 我不知道有这样的事情。

source: And I wanted it.
zh_cn: 我也想要。

source: When I was five, Lucy was fostered out from the care home in North Wales where we lived.
zh_cn: 我5岁时，有人从我们生活的北威尔士的慈善机构领养了露西。

source: I stopped eating.
zh_cn: 我绝食了。

source: In my notes it says that I was failing to thrive.
zh_cn: 我在笔记里写道：我停止了生长。

source: I do remember feeling I couldn't survive without her - she was my whole world.
zh_cn: 我记得当时的感觉就是没有露西我无法生存，她就是我的整个世界。

source: She came back though, after three months, and then later that year we were both fostered together, but it didn't work out as the new family decided they didn't want me.
zh_cn: 虽然几个月后露西回来了，而且随后我们被一起领养了，但还是不管用，因为我们的这个新家还是决定不想要我。

source: Lucy and I weren't glued together; we had different friends but I knew she was there and underneath was like me in a profound and inexplicable way.
zh_cn: 露西和我并不黏在一起，我们有各自的朋友。但是我知道她就在那，那是一种无法言说的感觉。

source: The longest I stayed in one place was when Lucy and I were fostered for five years - but it wasn't a happy house and when I dared to speak out, my bags were packed and I was gone.
zh_cn: 我和露西被领养后，在一个家庭呆了5年，那是我呆的时间最长的地方。那不是个幸福的家。当我敢于说出来时，我已经打包了行囊，我离开了。

source: No investigation.
zh_cn: 没人做调查。

source: I was 12 and after that I didn't see Lucy.
zh_cn: 我当时12岁，自那后再没见过露西。

source: For some reason I thought this meant she had stopped liking me.
zh_cn: 我想这意味着有什么原因让露西不再喜欢我了。

source: My memory kicks in properly when I was 15 and met my mother for the first time.
zh_cn: 记忆的闸门通向了我15岁那年第一次见到母亲的场景。

source: A social worker came to the home I was living in and took me out.
zh_cn: 一位社会工作者来到我住的地方，将我带了出去。

source: I thought maybe I was going to be moved again.
zh_cn: 我以为我又要被转移了。

source: We were near Llangollen in Wales and we turned up at a street of boarded-up and derelict houses.
zh_cn: 我们来到位于威尔士兰戈伦附近的一条街上，那里都是废弃的木屋。

source: We went into a grotty house and sat at a table with a bucket of coal in the middle.
zh_cn: 我们走进一间不堪入目的屋子，在一张桌子旁坐下，桌子中央放着一桶煤。

source: The social worker pointed at a woman sitting at the table and said: "This is your mum."
zh_cn: 这位社会工作者指着也坐在桌旁的一个女人说：“这位是你母亲。”

source: I thought, oh God.
zh_cn: 噢，上帝，我在心里默念。

source: I couldn't look. I couldn't understand why they had done this to me.
zh_cn: 我无法看她，我不能理解为什么他们这样对我。

source: She could have been anyone. I knew of her existence but by then it was too late.
zh_cn: 她本来可以是任何人，我知道她的存在，但现在来说，太迟了。

source: I thought I should have been at least asked if I wanted to meet her.
zh_cn: 我以为他们至少应该先征求下我是否想来见她。

source: I saw her a few times after that.
zh_cn: 那之后我见过她几次。

source: Once she came to the home I was living in and offered to take me out for the day.
zh_cn: 她曾经去过我住的地方，提出要带我出去呆一天。

source: At the home, we all wanted to escape, and on the rare occasion a parent surfaced they could take you out for a few hours.
zh_cn: 住在那的人都想逃出去，父母露面的机会虽极少，但他们能把你带出去呆几小时。

source: Even girls who'd been sexually abused by their dads were taken out by them.
zh_cn: 甚至连遭受过父亲性侵犯的女孩也被带出去了。

source: Some of them didn't mind having sex with their fathers because at least they escaped from the home.
zh_cn: 她们中的一些人不介意和父亲发生关系，因为起码她们从那个地方逃出来了。

source: I went out with my mother mainly because it was an opportunity to escape briefly.
zh_cn: 我和母亲出去主要是因为这是一个能暂时逃离那里的机会。

source: I felt fairly cold towards her.
zh_cn: 我对她很冷淡。

source: I don't think she had taken a driving test because she drove out straight across the lawn.
zh_cn: 我想她没有考到过驾照，因为车开出去时直接从草地上就过去了。

source: She picked me up a couple of other times and took me to see my grandmother who told me things about my mother; she explained that she was not capable of looking after children.
zh_cn: 她去接过我几次，还带我去看望了外祖母。外祖母告诉了我一些母亲的事情；她解释了为什么母亲没能力照顾孩子们。

source: My grandmother died shortly after I met her, so I am glad I got the chance.
zh_cn: 我们见面后不久外祖母就去世了，所以我很庆幸自己得到了那次机会。

source: After seeing Mum four or five times, I was moved and had no more contact with any of them.
zh_cn: 和母亲见了4、5次面后，我被转移了，再没和她们有过联系。

source: Mum died five years ago.
zh_cn: 5年后母亲去世了。

source: I didn't go to the funeral.
zh_cn: 我没有去墓地。

source: I felt that it was the only bit of power I could retain.
zh_cn: 我感觉这是我能有的唯一一点力量。

source: All my life, decisions had been made for me, but I was able to make this one and it felt good not to oblige her with my presence.
zh_cn: 我的一生都是别人在为我做决定，但这次我能自己做主。我不去，不遂她的愿，这种感觉很好。

source: In a way, her death signified a door closing on my past.
zh_cn: 在某种意义上，母亲的离世意味着通往我过去的一扇门被关上了。

source: I have tried as an adult to reconnect with my sisters, but it's hard if you haven't any bonds from childhood.
zh_cn: 成年后我曾经试着去重新联系我的姊妹们，但是很难，因为自孩子时代起我们就没有了任何联系。

source: It made me wish we had spent time together growing up.
zh_cn: 这令我特别希望能和她们一起长大。

source: I suddenly realised that although I couldn't change what had happened to me, perhaps I could do something for the 70,000 children who are now in care because, sadly, 86% of them are still separated from their brothers and sisters. We often have twins split up by the care system.
zh_cn: 我突然意识到，虽然我无法改变发生在我身上的事实，但是也许我可以为7万现正处在救助体制中的孩子们做点什么，因为他们中有86%的人仍然和他们的兄弟姐妹们分离着，其中还常常包括双胞胎。

source: My experience of being split up not only from Lucy but also my other siblings led me to want to do something about it.
zh_cn: 和露西，和其他姊妹们分离的经历促使我想在这方面做点什么。

source: After years of preparation, finally in 2008 I started the charity Siblings Together, which arranges holidays for siblings separated by care.
zh_cn: 准备了很多年后，我最终在2008年成立了“兄弟姐妹在一起”这个慈善团体，专为救助体制中分离的兄弟姊妹们安排节日。

source: Nothing is so heartwarming as to see them reconnect over a week's holiday - all my experiences seem to make sense because I know that my camps are repairing a bit of the damage.
zh_cn: 没有什么比看见他们每周一次的重聚更让人感动的了。我知道在我的营地里，伤痕正在渐渐修复，我经历的一切似乎都值了。

source: I was not fortunate enough to have any kind of relationship with most of my siblings, but I am thrilled that others can.
zh_cn: 我没有那么好的运气能和大多数的兄弟姐妹保持联系，但是我为别人能有这样的运气而感到兴奋。

source: At every camp the kids go away with albums packed with photographs.
zh_cn: 每一次聚会后，孩子们回去时带着的影集里都装满了照片。

source: I provide them all with cameras so they can capture their own memories.
zh_cn: 都是我用相机给他们拍的，这样他们就能留住一些回忆了。

source: I look back and see that the satisfaction I get now from doing what I do has come about as a result of a lonely and loveless start in life.
zh_cn: 回头看看，我知道是早年的孤独感和缺乏爱让我从我所做的事情中得到了满足。

source: I am fortunate enough to have two sons and cannot imagine ever putting them through what I have experienced.
zh_cn: 很幸运，我有两个儿子。我无法想象让他们去经历我经历过的事情。

source: I don't wallow in self-pity. I'd rather help people be happier with their lot. Especially children who can't live with their families.
zh_cn: 我不会一味地自怜，我更愿意帮助人们让他们更快乐，尤其是那些无法和自己的家人一起生活的孩子们。
